{
    "interview":[
        {
            "question": "Have you ever wanted to know your principal more? We asked so you don't have to!",
            "response": "As you all may know, Ms. Sullivan has quite the history with Classical Magnet. She used to be a history teacher before being promoted to principal. We asked her which job she preferred, responding with “I think that the hardest thing right now for me, is like I'm kind of overseeing and supervising the whole school as opposed to being in a classroom with 22 students which you get to know really well. I feel like that relationship between the teacher and the students in the classroom everyday is so powerful, so I definitely missed being in the classroom, but I also love the fact that some of the work I do can impact a whole school.”Hello, Gladiators! I am your principal, Ms. Sullivan. “My favorite color is blue, all different shades. My favorite food is spicy buffalo wings. Extra crispy, extra saucy, and extra spicy. I love to travel, cook, and hang out with family! I would describe myself as caring and fun. I’m not a favorites person, my taste varies depending on the topic. My favorite music genres are reggae, R&B, and indie. I love the people I work with. Students, teachers, parents. I like meeting different types of students with all different interests, I just appreciate the fact that I get to work in a school building with all these people I can build relationships with.”"
        },
        {
            "question": "We also asked a few questions relating to school events and topics you may have been wondering about! Are we doing any events this year?",
            "response": "“The school council and staff are trying to organize events for seniors such as bowling. Dances are more difficult, clearly because of COVID. It all depends on COVID numbers.” At least that's what Ms. Sullivan said. We believe that the dances are unlikely to happen, so don't get your hopes up."
        },
        {
            "question": "When are the student council meetings starting? ",
            "response": "Ms. Sullivan said “the student council meetings are supposed to start before break.” But due to scheduling, this didn't happen. However, student council members are still encouraged to collect ideas from their respective classes."
        },
        {
            "question": "What is the COVID protocol? ",
            "response": "Students are contact traced, which is why we have to sit in alphabetical order. There are two different things that could happen if you come into close contact. If you are vaccinated, you and your family are notified that a student who you have been in close contact with has COVID but you may still attend school. However, if you are not vaccinated, you are told to quarantine for 5-7 days or you have to provide a negative COVID test to the nurse. You may return to school either after the school receives the negative test or the quarantine days are up. If you do have covid, stay home until you feel better. "
        },
        {
            "question": "Why was lunch such a disaster for a bit? ",
            "response": "As some people may know, “HPS (Hartford Public Schools) is having some trouble with staffing, This resulted in not enough people being able to deliver supplies to the schools.” Having 10-15 out of 30 minutes to eat because of the long lunch line was a byproduct of this. Ms. Sullivan said that we could tell Mr. Martin and Mr. Tucker, the people who run the lunchwave, said that we need more time. “I have seen the office shoot up an email, letting teachers know that students are going to be late to class.” Since then the problem of not having enough time to eat has been put to the back of people's minds as the lunch waves go back to normal. Well as normal as it can get, my only hope is that they don’t change the lunchawave schedules again."
        },
        {
            "question": "Can students attend events/sports events? ",
            "response": "“No.” Flat out. Up to four family members can be in the audience of an at home game. It's unclear whether this is true for away games, From recent basketball games we can assume that it is untrue. If you’re still unsure please ask the coach to your family member’s team for more accurate information. Some may find this unfair due to the fact that the winter music concert, an event the music department had been preparing for months, was canceled due to COVID-19, but the basketball games remained in place throughout the whole season."
        },
        {
            "question": "Fundraising",
            "response": "The only set fundraising Ms. Sullivan mentioned was when grades sponsor dress downs and spirit weeks. We believe that since COVID has limited the amount of fundraising students can do, it’s going to be played by ear as the year progresses."
        }   

    ]
}