{
    "shortStory":
        {
            "magicalDestiny":"My mom bursts through my room door waking me up for the first day of the eighth grade. Her coming down the hallway already woke me up but when she opened the door, I still pretended to sleep hoping she’d let me stay home. I've never been a school person but only because I always felt alone. Being social has always been a problem for me. It's not like I want to be the only 14 year old without friends; I just don't know how to start. After beingstuck in my train of thought, I get snapped out of them by my alarm clock. I race down the stairs, out the door and start walking to school. The sun was already out and shining. I see the front entrance doors of the school getting closer and start to walk slower. I reached the door and hesitated. What if I never make friends? Let alone one friend. The loud class bell rang so I opened the door looking around like a lost puppy. As I walked into school my hands started to sweat. I walk down the hallways and see all these familiar faces but it seems like I don't know anyone at all. When you're walking somewhere, anywhere anxiously alone, it seems like everyone is staring at you but in reality, nobody really cares. I strut into my first class trying to seem as confident as I can but it still feels like there's a huge lump in my throat. Sit, introduction, leave. Every class period repeats itself. Finally it's lunch. I've been waiting all day for all that boring ‘My name is Mr. blah blah’stuff to end. When I open the lunchroom doors, my heart drops to my feet. Loud laughing and talking filled my ears, but I've always been good at tuning everyone out. Distractedly, I bump into this strong huge boy. He was so buff and tall I was shocked he was even in the eighth grade. Before I could apologize, I looked down and realized that his hot steamy lunch was all over my new shirt. Everyones gets quiet and immediately sends their hard stares my way. As I said before, I was good at tuning out but not at this moment. I heard every giggle, laugh, whisper in the whole cafeteria. I was so embarrassed. No, I was furious and I don’t know what even happened. Everything was in slow motion; I just looked at him and all of a sudden, the cup of milk that was in his hand was floating above his head and spilt all over him. I stood there for what felt like hours until I snapped back to reality and ran as fast as I could to the bathroom. How did I do that? No that wasn’t me; It was just a coincidence. I've never been a runner but I ran out of there so fast it was almost like a starving cheetah chasing its prey. Since I just magically poured milk into someone’s head, I had forgotten all about the hot lunch that had stained my shirt. As my anger started to fade away, I felt a gentle tap on my shoulder. I turned around to see who it was but I've never seen this girl before in my whole life. She didn't say a word while she silently comforted me. I look at her confused when she goes into her bag but she then pulls out a clean shirt and hands it to me. I was shocked. Why wasn’t she laughing at me? Why was she being so nice when she didn't even know me? Thoughts filled my head as I walked into the stall and changed into the black short sleeved shirt. She stood there waiting for me as I walked nervously out the stall so I thanked her. “You can keep the shirt” she giggles trying to lighten the mood. That day I walked out with a new shirt and a new friend.“My names Ashlee, Ashlee Davenport– What's yours?” I stood there before answering because I didn't know if she was serious or not. “Marisol Faye, but you can call me Mar.” It was nice to know that somebody had my back, but it was an even better feeling to have made a new friend. Maybe it was worth getting somebody's lunch spilled on me at lunch because without that happening, I wouldn't have met Ashlee. A few weeks had passed, I've realized that Ashlee and I were polar opposites; different but in a good way. She had fair skin, dull gray eyes and wavy hair that was jet black with bright hot pink highlights that spoke for itself what type of person she was. She was loud but not annoying, funny, spoke up for what she believed and I was a quiet loner who loved to read books about witches and wizards. Today was the first time we were hanging outside of school. All week she kept going on and on about how she wanted me to see her room since her brother refurnished it for her. “There's chalkboard walls and there's a bigger closet.. OH and I have a new Harry Potter Poster that I think you'd like” she says so loudly that almost everyone can hear.  She kind of reminds me of what having a little sister would be like minus the sharing and tattle tailing. I've never really been excited for something that involved a friend. Mainly because I've never had a real friend before. “Hello? I was just talking to my friend Mar but she seemed to have disappeared..” she says sarcastically; I laugh and say “I don't know who that is, but I can help you find her..” we laughed together until we heard the loud bell that told us lunch was over. Ashlee lived close to the school so we walked to her house after school. As I look to where she's heading I see a nice little house. It almost looks too perfect. Like it's from a movie or something. I remember her telling me that her father and mother got divorced some time ago, which explains the feminine decor her house has. My mom always tries to add certain things to the house to make it seem more ‘girl-like’ as she says but my dad always says “Susuan we have enough ‘girly’ stuff in the house, give it up” I never really understood why he was so against it until my brother told me one time his friends came over and they were making jokes about how he lets her control everything. Anyways, when we walk in we see her mom. “Lee, I made you and your new friend-” She just stares at me in awe; Almost like she sees me as royalty. “I-I- I can’t believe you found her.. The Vyvolený..I thought she was- “ Ashlee cuts her off and says “ Okay! gotta go upstairs now!” and pulls my arm up the stairs  making me trip a little bit. She has a big sign on her door that says “walk in, and you’ll die” and it looks like she wrote “especially you Jamie” in bright pink sharpie. I laughed because it was so her. Funny and to the point. “I'm guessing Jamie is your brother” I ask. She just nodded her head at me and rolled her eyes in disgust. I still couldn’t get her mom’s reaction out of my head. I didn’t really notice Ashlee treated me differently until now. It was like everything I did, said, or thought had to happen. After a couple hours my mom came to pick me up. I had a really good time at Ashlees’ house but something was a little off; It was like there was this secret that everyone had known about but me. As I sit in the passenger seat of my mom's car, I think about what had just happened. What does ’vyvolený’ even mean? Why did her mom have that reaction towards me? Should I try to get some answers tomorrow? Of course I had to try and pry some answers out of Ashlee; it’s not like she’d say no. I tried to sleep but I couldn’t keep my eyes closed for more than a few seconds. Finally it was daytime, and it was finally time for me to get some answers. I hurry to school and find Ashlee so I can put an end to this weirdness and move on. “ Hey. Um, why was your mom acting so weird yesterday? it was like she’d known who I was.. “ She just stared at me. It was obvious that she knew and wanted to tell me but all she said was, “ Just ask your mom I can’t really... tell you myself..” I was confused just like anyone else would be. Of course, since I wanted the schoolday to be over, it went by so slowly. Eventually it was the end of the schoolday and I hopped in the front seat of my moms’ 2003 Mitsubishi Eclipse just like every other day but this time, I wanted some answers. I know it didn’t seem like anything crazy but when I want to know something, I’m gonna know. I thought to myself, “ How can I make it seem like I didn’t have a clear motive? Kinda make it seem.... ordinary” I sat there for what felt like forever trying to figure out how I was going to start the conversation. “What does Vyvolený mean? “ I blurted out. “The ‘Chosen One’ in Czech.. Why? Do you finally want to learn?” The Chosen one? What does that even mean and why did Ashlee’s mom call ME that? I sat there confused until I finally asked her, “ So.. why did Ashlee’s mom call me that? “ She became so frozen; If we weren’t in Southern California during the summertime I'd think she’d turned into a popsicle. She was silent for most of the ride and I could tell there was something on her mind. “We're going to Ashlee and Mariah’s house so we can tell you what’s going on.. to prepare you... “  To be honest, I was petrified; Prepare me for what? We got to Ashlee’s house and the door opened as soon as we pulled in the driveway. “ I heard y’alls mind's racing from a mile away.. maybe y’all should calm down. “ Mariah says jokingly. What did she mean by heard? That’s physically impossible. My mom pulls Mariah and whispers in her ear and her eyes shoot open. She pulls me by the arm and we sit in the kitchen. My mom stares at me for a while until finally, “You see I’ve been wanting to tell you for a while but I just didn’t know how you would react or maybe you were to young or maybe- “ Mariah cuts her off excitedly, “ You’re the last of our kind so now you have to go on a long journey to get all of your powers... Oh and we're witches.. “ WITCHES? Last of our kind? I didn’t know how to take all of this in. There was like an hour of silence and staring. Not awkward at all. FInally Mariah offers to teach me more about how I can use my powers to reach the end. I guess I had to climb up 100 stairs to get to the top of this thing called the ‘Mystic Temple’ Whatever that means. This witch thing is weird and not usual but Mariah told me that our realm had been without a ruler for a while, waiting for me; I had to do this, not only for me, but for these people. “You have togo.. Sooner rather than later..” I was going tonight. I had too. My mom thought it was crazy but I wanted to help in any way I could. “How do I even get there?” Mariah explained how the whole thing would go down and wrote down all of the don’ts of crossing the magic portal. Don’t use your magic irresponsibility. Don’t mess with other people because they are much stronger. And finally, don’t show fear. She was telling me about how her and my mom would have to cast a hard spell to have the portal open for me since I was still in my beginning stage. My hands were already sweaty but after hearing all these things, I felt like I was going to barf. “ It’s all for a good cause” I kept telling myself. My mom and Mariah start saying these words that sound like they were just talking just to talk; I assumed they were saying the spell that’s going to get the portal open. I wonder if those words are just going to come naturally to me because I can't even remember what I ate this morning. All of a sudden, a swirly purple mist-like substance fills the air. “I can see something inside..” My mom gives me a reassuring look and nods her head so I walk through. I didn’t know what I was expecting, but it wasn’t this; It was like something you’d see in a movie. I try to remember why I was here in the first place but everything was so magical. I see where I have to go to get my first power; Mariah said it was called the “Mysterious Meadow” whatever that means; I feel like everything here is a mystery. I step over the little orange fence and there’s a large meadow of flowers, trees, and a long river that I have to cross over. First step, Figure out how I'm going to cross this water. Mar thinks. When my mom and Mariah opened the portal theywere saying just random words that went together so it’s worth a shot. “Crossing this water for me isn’t a challenge, Breathing under water is what I will manage” I stepped into the warm water and waited a second before I put my head underneath. It’s now or never. To my surprise, It worked. The spellworked. Maybe I was made for this. Mariah said that her mother would help me after I crossed the water. Purple cabin with a pink fence. I looked around and didn’t see much so I started to walk where my gut took me. It felt like I’d walked maybe 2 miles but I'd reached my destination. I knocked on the door four times like how I was told and heard the door unlocked. After opening the door I started walking toward the kitchen because I had heard some scrambling in that direction. “Welcome Home, I’m Donna.. and you must be Marisol” I studied her as she talked. She seemed like a nice older woman and Ashlee had resembled her a lot. “ Mar is fine but yes.. I hate to be too forward Mariah said that you would help me pass onto my next test” She laughs with the biggest smile. “ Of course sweetheart. Now listen to me, that Andy is no joke- so you have to be careful... “ From what I've seen so far, I’m guessing Andy is a magical dog that can speak Spanish or something.“No he’s not a dog he’s giant “ Of course he is- wait did she just read my mind? “Yes. Yes I did” Wow. What IS this place? Do I even have to talk since you can just know what I’m going to say anyways? “ Well you speaking outloud doesn’t make me look crazy so maybe yeah “ She once again laughs so loud it almost echoes. “ So Mar, you have to get by him quietly because if he hears you, he will catch you- or maybe he’ll turn you into a frog- or .. well no one has even tried to get past him in ages so I know as much as you... “ Well that isn’t helping me now is it, '' I thought. “ I can hear you, you know- Sorry Donna.. “ It's like the more time I spend in this place the more insane I feel; Imean a giant named Andy? Really. “ Back to the basics.. Casting a spell isn’t easy for beginners but since you’re the Vyvolený, it’s gonna be a piece of cake... ‘this giant is big and mean, get me walking without making a scene’..that should do it for ya..I hope.. '' She said the last part so quietly I almost didn’t hear her but I definitely did; It made my head feel like it’s going to lestchair and it was so hard for me not to laugh. Eventually, Andy was so far away he looked like an ant; Well maybe not an ant more like a tree. My feet finally touch the ground and I feel less anxious. The last thing I have to do toget my last power is climb the ‘Mystic Temple’. Mariah said that it was 150 stairs but if I was worthy enough, it would only feel like 20. 20 stairs is still alot of stairs after the day I just had. Time here is different from time back home. Every hour here is a minute back home. I wonder what my mom is doing right now. Probably has her hands together pacing back and forth; She’s always been a worrier, but I couldn’t blame her. Miles and miles later, I step up to the temple. “First step, huh” I said to myself. These steps look like they haven’t been stepped on in centuries. “ AHHH! SNAKE!” I darted up the stairs like my left depended on it. I didn’t know what came over me but I was so terrified and said, “ SNAKE SNAKE SUCH A FAKE, GET THIS SNAKE OUT OF MY FACE” And right before my eyes, the snake just disappeared. That was a close one- Let’s hope that’s all that’s up here” I was walking up a magic temple to get the rest of my powers; Of course I had spoken too soon. Now that I was almost at the top, I noticed that the stepswere starting to get smaller and smaller so it was getting harder after each step. I kept having to remind myself that other people were waiting for me to gain all of my powers because this was the most tiring thing in the world. Imean 100 steps really? If they were so magical, why didn't they just magically build an elevator or something? These stairs had gotten so small that I’m almost balancing myself on them to prevent myself from falling backwards. “ Is that- Is that the top? “ I said to myself in confusion. It wasn't “Mystic” or ‘Magical’ at all; It was dusty and looked ran down. There was a statue of a woman with her hands placed out on her lap. In her hands there was a medium sized ball; It was golden and looked like a ball of energy. I just stood there and stared at it for a while. Just to think– I can be the most powerful witch in the whole realm, just by touching this little ball. Then I remembered, not just anyone could have done this; I was born chosen. I was born to do this. I grabbed the ball and I felt like the most powerful thing inthe world. Brave. Confident. Independent. One thing did stop me from this reward though; Was I going to leave behind my normal teenage life to do this. I mean ruler of the Magical Realm? That was a huge decision I'd have tomake. “ Would I ever see my family again? Does my whole family even know about this?” Questions filled my mind. “ I gotta get home..” I opened the portal and climbed back into Ashlee and Mariahs’ living room. “See you soon..” I said before I left. “Marisol?? Are you okay?” My mom ran up to meand squeezed me so hard I could barely breathe. “ Of course I'm okay, I am the ruler of the Magical Realm you know” She hugged me even tighter. While hugging my mom and Mariah I came to an epiphany; This isn't random. Yeah having a normal teenage life is meant for regular people, but this was my calling. Being a leader, a ruler. I couldn't just leave these people without a ruler. Would the president leave office to work at a grocery store? No. because they were born to lead and help others; Leadership is in my DNA and I was going to prove it not only to me but to my people. Just at the beginning of the year, I was an ordinary, friendless 14 year old girl wiping some losers’ lunch off my clothes; Now, I feel the greatest I've ever felt in my life. Physically and mentally. I finally know what my purpose is and it is changing my life every minute for the better. I feel complete and empowered; I was prepared to take over and make sure everyone was proud to call me their leader. "
        }
}
